// Задача 19

// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// 14212 -> нет

// 12821 -> да

// 23432 -> да

////////////////////////////////////////////////////////////////////////////////////
Console.Write("Вариант 1");//Решаем через вычисление
Console.Write("Введите пятизначное число: ");
int A = Convert.ToInt32(Console.ReadLine());

if ((A / 10000) % 10 == A % 10 && (A / 1000) % 10 == (A / 10) % 10) Console.WriteLine($"{A} -> да");
else Console.WriteLine($"{A} -> нет");
////////////////////////////////////////////////////////////////////////////////////

Console.Write("Вариант 2");//Решаем через сравнение в строке
Console.Write("Введите пятизначное число: ");
string B = Console.ReadLine();

if (B[0] == B[4] && B[1] == B[3]) Console.WriteLine($"{B} -> да");
else Console.WriteLine($"{B} -> нет");